x = 50
def func():
    global x
    x = 10
    print('Спочатку x дорівнює', x)  # x дорівнює 50
    x = 20
    print('Змінюємо глобальне значення x на', x)  # Змінюємо глобальне значення x на 2
    def inner_func():
        x = 15
        print('Змінюємо локальне значення x на', x)  # Змінюємо глобальне значення x на 5
        def innermost_func():
            nonlocal x
            x = 7
            print('Змінюємо суперлокальне значення x на', x)  # Змінюємо глобальне значення x на 5 
        innermost_func()
        print('Перевіряємо суперлокальне значення x на', x)  # Змінюємо глобальне значення x на 5 
    inner_func()
    print('Значення x після виклику inner_func()', x)  # Значення x після виклику inner_func() 5
func()
print('Глобально значення x складає', x)# Значення x складає 2
