from typing import Generator, Callable

# Генератор, який приймає рядок і видає всі числа з цього рядка у вигляді float
def generator_numbers(text: str) -> Generator[float, None, None]:
    for word in text.split(): # Розділяємо текст на слова і проходимо по кожному слову
        try:
            yield float(word) # Намагаємося перетворити слово в число з плаваючою крапкою і видаємо його, якщо це можливо, відпочиваючи виконання функції до наступного виклику генератора
        except ValueError: # Якщо перетворення не вдається (тобто слово не є числом), просто пропускаємо його
            continue # Продовжуємо цикл, не видаючи нічого для цього слова та переходячи до наступного слова (шукаємо число через Yield)

# Функція, яка приймає рядок і генератор чисел - повертає суму всіх чисел, які видає генератор 
def sum_profit(text: str, generator_numbers: Generator[float, None, None]) -> float:
    return sum(generator_numbers(text))


text = "Загальний дохід працівника складається з декількох частин: 1000.01 долл. США як основний дохід, доповнений додатковими надходженнями 27.45 і 324.00 доларів. Крім того, він отримав бонус у розмірі 150.75 доларів за успішне виконання проекту, що також підвищило його загальний дохід."
total_income = sum_profit(text, generator_numbers)
print(f"Загальний дохід працівника склав: {total_income} доларів США.")